{
	"title":"Come funziona",
	"text":"<p>Questo sito è un aggregatore di news ad argomento politico.</p><h2>Quali news vengono aggregate?</h2><p>Un nostro bot cerca continuamente Tweet a carattere politico. Se questi tweet contengono link ad articoli di giornali online, il link viene verificato, esplorato, ed elaborato: viene calcolato il \"sentiment\", ed analizzato il testo per estrarne le parole chiave più rilevanti. Una volta che un articolo è stato validato, il link viene messo in una coda di monitoraggio, che si occupa di verificare, ad intervalli di tempo regolari e per un periodo di cinque giorni da quando è stato scoperto, la sua diffusione su Facebooke Twitter. Sulla base del numero delle diverse interazioni sui social network, ad ogni articolo viene assegnato un indice di popolarità.</p><p>L'archivio cosi creato, consultabile in ordine cronologico, con aggregazioni per schieramento politico, per tag oppure tramite ricerca di testo, si arricchisce di circa 150 nuovi articoli ogni giorno.<h2>Quali sono le fonti delle news?</h2><p>Per evitare di cadere nella trappola delle <i>fake news</i>, abbiamo creato una <i>whitelist</i> di siti che include tutti i siti di news italiani compresi nei primi cinquanta posti della classifica Audiweb, più i siti dei quotidiani, anche locali.</p><h2>Quali informazioni vengono mostrate?</h2><p>Degli articoli elaborati, salviamo il titolo ed una breve descrizione. L'articolo completo è sempre consultabile sul sito sul quale è stato originariamente pubblicato. La classificazione per schieramento (\"Destra\",\"Centro Destra\", \"Movimento 5 Stelle\", \"Centro Sinistra\", \"Sinistra\"), così come tag e sentiment, <b>assegnati automaticamente dai nostri bot</b>, consentono l'accesso ad aggregazioni differenti degli stessi articoli.</p><p>I grafici della popolarità consentono di avere un'idea di quale sia l'impatto dell'articolo sui social network in termini assoluti (in relazione alla popolarità media degli altri articoli indicizzati oppure in relazione alla popolarità media degli altri articoli che fanno riferimento allo stesso schieramento), che come evoluzione cronologica.</p><p class=\"img\"><img src=\"./images/pop.png\" /></p><p class=\"img\"><img src=\"./images/pop-time.png\" /></p><h2>Ogni quanto viene aggiornato il sito?</h2><p>Spesso. Non siamo in grado di essere precisi perché l'aggiornamento del database è un processo continuo, lungo, ed <i>asincrono</i>: vengono gestite differenti <i>code</i> di elaborazione che fanno sì che mentre un articolo viene analizzato per capirne il \"sentiment\", per altri articoli si sta misurando la popolarità. E mentre queste operazioni vengono completate i nostri bot sono già alla ricerca di nuovi contenuti, che verranno poi accodati ai precedenti. Questo è il motivo per cui per alcuni articoli non sono disponibili tutte le informazioni: il bot non ha ancora finito di raccogliere ed elaborare i dati.</p><h2>Come vengono categorizzati gli articoli</h2><p>Sia l'attività di catalogazione, che quella di attribuzione delle parole chiave (<i>tag</i>) sono automatiche e sono sviluppate utilizzando <a href=\"https://wit.ai\">Wit.ai</a> come motore di interpretazione del linguaggio naturale. La scelta di automatizzare queste attività ci consente, da un lato, di essere in grado di elaborare grandi quantità di informazioni in tempi relativamente brevi, dall'altro di assicurare quanta più neutralità possibile su un sito che tratta un argomento delicato come le elezioni politiche.</p><h2>Cosa sono i \"Temi\"?</h2><p>Lo scopo dei temi è fornire un accesso privilegiato ad aggregazioni di news che trattano lo stesso argomento, e che fanno riferimento ad un avvenimento importante (o che ha generato tanti contenuti) accaduto durante la campagna elettorale. Le keyword proposte servono ad aiutarti a filtrare meglio gli articoli presenti nel database, aiutandoti ad estrarre solo quelli relativi al \"tema\" selezionato.</p><h2>Che tool e strumenti avete utilizzato per realizzare il sito?</h2><p>I <b>bot</b> e le <b>API</b> sono stati scritti in PHP, basandosi su <a href=\"https://github.com/leeppolis/php-boilerplate\">PHP Boilerplate</a> ed utilizzando, tra gli altri, <a href=\"https://github.com/FriendsOfPHP/Goutte\">Goutte</a>, <a href=\"https://github.com/abraham/twitteroauth\">Twitter oAuth</a>, <a href=\"https://github.com/facebook/php-graph-sdk\">Graph SDK</a>, e <a href=\"https://github.com/tgallice/wit-php\">Wit PHP</a>.</p><p>I <b>frontend</b> dei siti sono invece stati scritti utilizzando <a href=\"https://reactjs.org/\">React</a> e <a href=\"https://d3js.org/\">D3.js</a>.</p><p>Per l'<b>analisi del linguaggio naturale</b>, utilizziamo <a href=\"https://wit.ai\">Wit.ai</a>.</p><h2>Chi c'è dietro a questo sito?</h2><p>Carlo Zapponi e Simone Lippolis. Lo abbiamo fatto per passione e per curiosità. Non abbiamo alcuno sponsor, istituzionale o occulto. Se volete saperne un po' più su di noi potete visitare la pagina \"<a href=\"#/leggi/chi-siamo\">Chi siamo</a>\".</p>"
}


